#define _CRT_SECURE_NO_WARNINGS 1

//简述大端字节序和小端字节序的概念

//大端字节序：把一个数据的低位保存在内存的高地址处，高位保存在内存的低地址处

//小端字节序：把一个数据的低位保存在内存的低地址处，高位保存在内存的高地址处


//设计一个小程序来判断当前机器的字节序
#include <stdio.h>

//int main()
//{
//	int a = 1;
//	char* p = (char*)&a;
//	if (*p == 1)
//	{
//		printf("小端\n");
//	}
//	else
//		printf("大端\n");
//	return 0;
//}

//int a = 1 
//如果将a的地址强制类型转换为char* 解引用得到的数字如果是1说明低地址存放的是数据的低位 就是小端字节序
//反之 就是大端字节序

//int check_sys()
//{
//	int a = 1;
//	return *(char*)&a;
//}
//
//int main()
//{
//	if (check_sys() == 1)
//		printf("小端\n");
//	else
//		printf("大端\n");
//	return 0;
//}


//%u是打印无符号整型 认为内存中存放的补码对应的是一个无符号数
//%d是打印有符号整型 认为内存中存放的补码对应的是一个有符号数
int main()
{
	/*char a = 127;
	char b = a + 1;
	printf("%d\n", b);*/
	char a = -128;
	//10000000 00000000 00000000 10000000 -- a 原码
	//11111111 11111111 11111111 01111111
	//11111111 11111111 11111111 10000000 -- a 补码
	printf("%u\n", a); //这里打印整型 整型提升（按照a的类型整型提升 a是有符号char）
	//10000000
	//11111111 11111111 11111111 10000000
	return 0;
}

int main()
{
	char a = 128;
	//00000000 00000000 00000000 10000000
	printf("%d\n", a); //char 127 + 1 = -128
	//10000000
	//11111111 11111111 11111111 10000000
	return 0;
}

//补码运算 格式化为有符号整数
int main()
{
	int i = -20;
	unsigned int j = 10;
	printf("%d\n", i + j);
	return 0;
}

int main()
{
	unsigned int i;
	for (i = 9; i >= 0; i--)
	{
		printf("%u\n", i);
	}
	return 0;
}